CREATE DATABASE  IF NOT EXISTS `mydb` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `mydb`;
-- MySQL dump 10.13  Distrib 8.0.13, for Win64 (x86_64)
--
-- Host: localhost    Database: mydb
-- ------------------------------------------------------
-- Server version	8.0.13

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `businesses`
--

DROP TABLE IF EXISTS `businesses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `businesses` (
  `BusinessesID` int(11) NOT NULL,
  `BusinessesAGEMKO` varchar(45) DEFAULT NULL,
  `BusinessesStatus` varchar(45) DEFAULT NULL,
  `BusinessesAMKE` varchar(45) DEFAULT NULL,
  `BusinessesVAT` varchar(45) DEFAULT NULL,
  `BusinessesDescr` varchar(250) DEFAULT NULL,
  `BusinessesDistinctTitle` varchar(250) DEFAULT NULL,
  `BusinessesNumMembers` int(11) DEFAULT NULL,
  `BusinessesAddress` varchar(250) DEFAULT NULL,
  `BusinessesEmail` varchar(45) DEFAULT NULL,
  `BusinessesRegisterDate` datetime DEFAULT NULL,
  `BusinessesReviewDate` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `MainActivity_MainActivityID` int(11) DEFAULT NULL,
  `RegistryType_RegistryTypeID` int(11) DEFAULT NULL,
  `IndividualCategory_IndividualCategoryID` int(11) DEFAULT NULL,
  `Status_StatusID` int(11) DEFAULT NULL,
  `Region_RegionID` int(11) DEFAULT NULL,
  `RegionalUnity_RegionalUnityID` int(11) DEFAULT NULL,
  `Municipality_MunicipalityID` int(11) DEFAULT NULL,
  `BusinessesExtraField` varchar(2000) DEFAULT NULL,
  PRIMARY KEY (`BusinessesID`),
  KEY `fk_Businesses_MainActivity1_idx` (`MainActivity_MainActivityID`),
  KEY `fk_Businesses_RegistryType1_idx` (`RegistryType_RegistryTypeID`),
  KEY `fk_Businesses_IndividualCategory1_idx` (`IndividualCategory_IndividualCategoryID`),
  KEY `fk_Businesses_Status1_idx` (`Status_StatusID`),
  KEY `fk_Businesses_Region1_idx` (`Region_RegionID`),
  KEY `fk_Businesses_RegionalUnity1_idx` (`RegionalUnity_RegionalUnityID`),
  KEY `fk_Businesses_Municipality1_idx` (`Municipality_MunicipalityID`),
  CONSTRAINT `fk_Businesses_IndividualCategory1` FOREIGN KEY (`IndividualCategory_IndividualCategoryID`) REFERENCES `individualcategory` (`individualcategoryid`),
  CONSTRAINT `fk_Businesses_MainActivity1` FOREIGN KEY (`MainActivity_MainActivityID`) REFERENCES `mainactivity` (`mainactivityid`),
  CONSTRAINT `fk_Businesses_Municipality1` FOREIGN KEY (`Municipality_MunicipalityID`) REFERENCES `municipality` (`municipalityid`),
  CONSTRAINT `fk_Businesses_Region1` FOREIGN KEY (`Region_RegionID`) REFERENCES `region` (`regionid`),
  CONSTRAINT `fk_Businesses_RegionalUnity1` FOREIGN KEY (`RegionalUnity_RegionalUnityID`) REFERENCES `regionalunity` (`regionalunityid`),
  CONSTRAINT `fk_Businesses_RegistryType1` FOREIGN KEY (`RegistryType_RegistryTypeID`) REFERENCES `registrytype` (`registrytypeid`),
  CONSTRAINT `fk_Businesses_Status1` FOREIGN KEY (`Status_StatusID`) REFERENCES `status` (`statusid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `businesses`
--

LOCK TABLES `businesses` WRITE;
/*!40000 ALTER TABLE `businesses` DISABLE KEYS */;
/*!40000 ALTER TABLE `businesses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `individualcategory`
--

DROP TABLE IF EXISTS `individualcategory`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `individualcategory` (
  `IndividualCategoryID` int(11) NOT NULL,
  `IndividualCategoryDescr` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`IndividualCategoryID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `individualcategory`
--

LOCK TABLES `individualcategory` WRITE;
/*!40000 ALTER TABLE `individualcategory` DISABLE KEYS */;
INSERT INTO `individualcategory` VALUES (1,'Αγροτικοί Συνεταιρισμοί του ν. 4384/2016'),(2,'Αστικές εταιρίες των αρ. 741 Α.Κ'),(3,'Αστικοί Συνεταιρισμοί του ν. 1667/1986'),(4,'Κοι.Σ.Π.Ε'),(5,'Κοιν.Σ.Επ. Ένταξης Ειδικών Ομάδων'),(6,'Κοιν.Σ.Επ. Ένταξης Ευάλωτων Ομάδων'),(7,'Κοιν.Σ.Επ. Συλλογικής και Κοινωνικής Ωφέλειας'),(8,'Λοιπές νομικές μορφές'),(9,'Συνεταιρισμοί Εργαζομένων'),(10,'Σωματεία (αρ.78 επ ΑΚ)');
/*!40000 ALTER TABLE `individualcategory` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `mainactivity`
--

DROP TABLE IF EXISTS `mainactivity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `mainactivity` (
  `MainActivityID` int(11) NOT NULL,
  `MainActivityDescr` varchar(500) DEFAULT NULL,
  PRIMARY KEY (`MainActivityID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `mainactivity`
--

LOCK TABLES `mainactivity` WRITE;
/*!40000 ALTER TABLE `mainactivity` DISABLE KEYS */;
INSERT INTO `mainactivity` VALUES (1,'Άλλες υπηρεσίες τροφοδοσίας εκδηλώσεων (catering)'),(2,'Υπηρεσίες εξωραϊστικών και αναπτυξιακών σωματείων, ενώσεων, συνεταιρισμών κλπ'),(3,'Υπηρεσίες κατασκήνωσης (κάμπιγκ), εγκαταστάσεων για οχήματα αναψυχής (τροχόσπιτα) και ρυμουλκούμενα οχήματα (τρέιλερ)'),(4,'Υπηρεσίες διοργάνωσης επιμορφωτικών σεμιναρίων'),(5,'Χονδρικό εμπόριο πιτών και κουλουριών'),(6,'Υπηρεσίες συμβούλου ψυχικής υγείας'),(7,'Υπηρεσίες συλλογής μη επικίνδυνων ανακυκλώσιμων απορριμμάτων'),(8,'Λιανικό εμπόριο ειδών παντοπωλείου'),(9,'Παραγωγή μελιού φυσικού'),(10,'Υπηρεσίες οργάνωσης επιστημονικών ή πολιτιστικών εκδηλώσεων'),(11,'Υπηρεσίες άλλης καλλιτεχνικής ομάδας'),(12,'Υπηρεσίες παροχής γευμάτων από εστιατόριο ταχείας εξυπηρετήσεως (φαστ - φουντ), με παροχή σερβιρίσματος'),(13,'Υπηρεσίες επεξεργασίας σπόρων πολλαπλασιασμού'),(14,'Άλλες υπηρεσίες υποστήριξης για τη βελτίωση της ζωής των πολιτών και την αναβάθμιση των γενικών συνθηκών διαβίωσης'),(15,'Υπηρεσίες επίσκεψης και παροχής υποστήριξης σε ηλικιωμένους'),(16,'Άλλες αθλητικές δραστηριότητες'),(17,'Παραγωγή μακαρονιών, λαζανιών, κουσκούς και παρόμοιων αλευρωδών προϊόντων'),(18,'Λιανικό εμπόριο μεταχειρισμένων ειδών σε καταστήματα'),(19,'Υπηρεσίες πλήρους διαφήμισης'),(20,'Υπηρεσίες που παρέχονται από αναψυκτήριο'),(21,'Χονδρικό εμπόριο καφέ, μη αποκαφεϊνωμένου'),(22,''),(23,'Υπηρεσίες εκπαίδευσης μέσω επιμορφωτικών σεμιναρίων'),(24,'Δραστηριότητες άλλων οργανώσεων π.δ.κ.α.'),(25,'Υπηρεσίες παραγωγής κινηματογραφικών ταινιών, βίντεο και τηλεοπτικού προγράμματος'),(26,'Εργασίες κατασκευών διακόσμησης'),(27,'Υπηρεσίες τουριστικής προβολής και ενημέρωσης επισκεπτών'),(28,'Υπηρεσίες διάθεσης άλλων ανακυκλώσιμων μη επικίνδυνων απορριμμάτων'),(29,'Υπηρεσίες επίσκεψης και παροχής υποστήριξης για άτομα με αναπηρίες'),(30,'Πολιτιστική εκπαίδευση'),(31,'Μικτές γεωργοκτηνοτροφικές δραστηριότητες'),(32,'Καλλιέργεια λαχανικών με φύλλα ή μίσχους'),(33,'Ξενοδοχεία και παρόμοια καταλύματα'),(34,'Υπηρεσίες ψυχολόγου'),(35,'Υπηρεσίες προβολής και διοργάνωσης καλλιτεχνικών εκδηλώσεων'),(36,'Χονδρικό εμπόριο αρωματικών φυτών'),(37,'Λιανικό εμπόριο εκκλησιαστικών ειδών π.δ.κ.α.'),(38,'Υπηρεσίες συντήρησης έργων τέχνης'),(39,'Υπηρεσίες βιομηχανικού σχεδιασμού'),(40,'Άλλες μεταποιητικές δραστηριότητες π.δ.κ.α.'),(41,'Επεξεργασία αφεψημάτων βοτάνων'),(42,'Υπηρεσίες θεατρικών και λοιπών δημοσίων θεαμάτων γενικά'),(43,'Υπηρεσίες διάθεσης χρόνου στα ηλεκτρονικά μέσα ενημέρωσης για παρουσίαση διαφημίσεων'),(44,'Υπηρεσίες κοινωνικής μέριμνας χωρίς παροχή καταλύματος για ηλικιωμένους και άτομα με αναπηρία'),(45,'Κατασκευή κεραμικών ειδών οικιακής χρήσης και κεραμικών διακοσμητικών ειδών'),(46,'Υπηρεσίες εναλλακτικών θεραπειών'),(47,'Υπηρεσίες που παρέχονται από παραδοσιακό καφενείο'),(48,'Υπηρεσίες στεγασμένων χώρων άλλων καλλιτεχνικών εκδηλώσεων'),(49,'Δραστηριότητες παροχής επιχειρηματικών συμβουλών και άλλων συμβουλών διαχείρισης'),(50,'Κατασκευή κοσμημάτων και συναφών ειδών'),(51,'Νοσοκομειακές υπηρεσίες'),(52,'Καλλιέργεια φυτών που χρησιμοποιούνται κυρίως στην αρωματοποιία, τη φαρμακευτική, ή για εντομοκτόνα, μυκητοκτόνα ή παρόμοιους σκοπούς'),(53,'Υπηρεσίες γενικού καθαρισμού κτιρίων'),(54,'Υπηρεσίες πολιτιστικής εκπαίδευσης'),(55,'Δραστηριότητες μουσείων'),(56,'Δραστηριότητες προγραμματισμού ηλεκτρονικών συστημάτων'),(57,'Υπηρεσίες προστατευόμενων φυσικών βιοτόπων, περιλαμβανομένης της προστασίας της άγριας πανίδας και χλωρίδας'),(58,'Υπηρεσίες παροχής περιβαλλοντικών συμβουλών'),(59,'Υπηρεσίες παροχής γευμάτων και ποτών από ουζερί, μεζεδοπωλείο, τσιπουράδικο, ζυθοπωλείο με παροχή σερβιρίσματος'),(60,'Υπηρεσίες καθοδήγησης ατόμων με προβλήματα'),(61,'Άλλες υπηρεσίες πολιτιστικής εκπαίδευσης'),(62,'Δραστηριότητες κοινωνικής μέριμνας χωρίς παροχή καταλύματος για ηλικιωμένους και άτομα με αναπηρία'),(63,'Τέχνες του θεάματος'),(64,'Λιανικό εμπόριο ειδών δώρων γενικά'),(65,'Παραγωγή ηλεκτρικής ενέργειας από φωτοβολταϊκά συστήματα'),(66,'Υπηρεσίες διαχειριστών περιηγήσεων'),(67,'Δραστηριότητες παραγωγής κινηματογραφικών ταινιών, βίντεο και τηλεοπτικών προγραμμάτων'),(68,'Υπηρεσίες παροχής συμβουλών στρατηγικής διαχείρισης'),(69,'Κατασκευή κοσμημάτων από πλαστικό, ύφασμα, ξύλο, όστρακα, μη πολύτιμες πέτρες, κοινά μέταλλα και άλλα υλικά'),(70,'Κατασκευαστικές εργασίες για μη οικιστικά κτίρια (νέες εργασίες, προσθήκες, μετατροπές και ανακαινίσεις)'),(71,'Εξαγωγή ελαιόλαδου'),(72,'Υπηρεσίες διοργάνωσης συνεδρίων'),(73,'Άλλες ταχυδρομικές και ταχυμεταφορικές υπηρεσίες'),(74,'Εργασίες επισκευής και συντήρησης ιστορικών και παραδοσιακών κτιρίων'),(75,'Υπηρεσίες που παρέχονται από άλλες οργανώσεις π.δ.κ.α.'),(76,'Υπηρεσίες γραφείων διοργάνωσης οργανωμένων περιηγήσεων (ταξιδιωτικών πακέτων)'),(77,'Υλοτομία καυσόξυλων'),(78,'Υπηρεσίες παραγωγής και παρουσίασης καλλιτεχνικών εκδηλώσεων'),(79,'Υπηρεσίες διοργάνωσης συνεδρίων και εμπορικών εκθέσεων'),(80,'Χονδρικό εμπόριο ελαιόλαδου'),(81,'Υπηρεσίες επαγγελματικής αποκατάστασης για ανέργους'),(82,'Καλλιέργεια καρυκευτικών, αρωματικών, θεραπευτικών και φαρμακευτικών φυτών'),(83,'Εργασίες επιχωματώσεων'),(84,'Εμπορικοί αντιπρόσωποι που μεσολαβούν στην πώληση διαφόρων ειδών'),(85,'Υπηρεσίες παροχής επιστημονικών τεχνικών συμβουλών γενικά'),(86,'Υπηρεσίες καθοδήγησης και παροχής συμβουλών π.δ.κ.α. σχετικές με τα παιδιά'),(87,'Υπηρεσίες φροντιστηρίου γενικά (θετικών ή θεωρητικών επιστημών)'),(88,'Άλλες υπηρεσίες πρωτοβάθμιας εκπαίδευσης'),(89,'Υπηρεσίες φιλανθρωπικών σωματείων'),(90,'Υπηρεσίες γενικής ιατρικής'),(91,'Υπηρεσίες διακοσμητή κατοικιών'),(92,'Υπηρεσίες διοργάνωσης εμπορικών εκθέσεων'),(93,'Υπηρεσίες τοπικών συλλόγων και σωματείων'),(94,'Υπηρεσίες φροντιστηρίου ξένων γλωσσών'),(95,'Υπηρεσίες καθαρισμού κοινόχρηστων χώρων κατοικιών και επαγγελματικών χώρων'),(96,'Δραστηριότητες μηχανικών και συναφείς δραστηριότητες παροχής τεχνικών συμβουλών'),(97,'Υπηρεσίες διεξαγωγής σεμιναρίων επιμόρφωσης στελεχών επιχειρήσεων'),(98,'Υπηρεσίες που παρέχονται από καφενείο, χωρίς τεχνικά και μηχανικά παιχνίδια'),(99,'Εμπορικοί αντιπρόσωποι που μεσολαβούν στην πώληση οίνου από σταφύλια'),(100,'Παραγωγή μαρμελάδας, κομπόστας, γλυκών κουταλιού και παρόμοιων ειδών, από φρούτα και άλλους καρπούς'),(101,'Άλλες υπηρεσίες παροχής επιχειρηματικών συμβουλών'),(102,'Υπηρεσίες προβολής αθλητικών εκδηλώσεων και ψυχαγωγικών αθλητικών εκδηλώσεων'),(103,'Υπηρεσίες γυμναστηρίου ενόργανης ή μη γυμναστικής'),(104,'Υπηρεσίες ενοικίασης επιπλωμένων διαμερισμάτων, με παροχή υπηρεσιών περιποίησης πελατών'),(105,'Υπηρεσίες προσχολικής εκπαίδευσης'),(106,'Εργασίες τοποθέτησης μεταλλικών κουφωμάτων'),(107,'Έκδοση βιβλίων'),(108,'Λιανικό εμπόριο διάφορων τουριστικών και λοιπών παρόμοιων ειδών λαϊκής τέχνης'),(109,'Υπηρεσίες σχολών καλών τεχνών και διδασκάλων τεχνών'),(110,'Συλλογή βρώσιμων προϊόντων αυτοφυών φυτών'),(111,'Υπηρεσίες επισκευής επίπλων και ειδών οικιακής διακόσμησης'),(112,'Υπηρεσίες κοινωνικών ερευνών'),(113,'Δραστηριότητες δημοσίων σχέσεων και επικοινωνίας'),(114,'Υπηρεσίες παροχής συμβουλών σε θέματα οργάνωσης παραγωγής'),(115,'Παρουσίαση στα μέσα ενημέρωσης'),(116,'Χώροι κατασκήνωσης, εγκαταστάσεις για οχήματα αναψυχής και ρυμουλκούμενα οχήματα'),(117,'Υπηρεσίες νοσηλευτή'),(118,'Μη εξειδικευμένο χονδρικό εμπόριο'),(119,'Δραστηριότητες αρχιτεκτόνων'),(120,'Υπηρεσίες υποστήριξης επιχειρήσεων για την ένταξή τους σε αναπτυξιακά προγράμματα'),(121,'Υπηρεσίες ανάπτυξης λογισμικού πολυμέσων (multimedia)'),(122,'Υπηρεσίες μουσικών σχολών και διδασκάλων μουσικής'),(123,'Υπηρεσίες ηχογράφησης και ζωντανής εγγραφής ήχου· παραγωγή πρωτοτύπων ηχογραφήσεων'),(124,'Υπηρεσίες τροφοδοσίας εκδηλώσεων (catering)'),(125,'Υπηρεσίες ψυχικής υγείας'),(126,'Υπηρεσίες ιστοφιλοξενίας (web hosting)'),(127,'Λιανικό εμπόριο άλλων οικιακών ειδών π.δ.κ.α.'),(128,'Υπηρεσίες παροχής γευμάτων από εστιατόριο ταχείας εξυπηρετήσεως (φαστ-φουντ), με παροχή καθίσματος, αλλά όχι σερβιρίσματος'),(129,'Υπηρεσίες που παρέχονται από καφετέρια'),(130,'Άλλες υπηρεσίες διαφήμισης'),(131,'Υπηρεσίες εκπαίδευσης π.δ.κ.α.'),(132,'Υπηρεσίες πολιτιστικών συλλόγων και σωματείων'),(133,'Υπηρεσίες προστασίας ειδικών ομάδων'),(134,'Υπηρεσίες που παρέχονται από πολιτιστικές και ψυχαγωγικές ενώσεις'),(135,'Διοικητικές ψυχαγωγικές, πολιτιστικές και θρησκευτικές υπηρεσίες'),(136,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης στις γεωπονικές επιστήμες'),(137,'Υπηρεσίες ανάπτυξης και υποστήριξης λογισμικού εφαρμογών τηλεματικής'),(138,'Έκδοση έντυπων εφημερίδων'),(139,'Δραστηριότητες νοσοκομειακής φροντίδας με παροχή καταλύματος'),(140,'Κατασκευή ειδών κοσμηματοποιίας και μερών τους· ειδών χρυσοχοΐας ή αργυροχοΐας και μερών τους'),(141,'Καλλιέργεια λαχανικών και πεπονοειδών, ριζών και κονδύλων'),(142,'Υπηρεσίες διαμόρφωσης και περιποίησης κήπων (υπηρεσίες κηπουρού)'),(143,'Προετοιμασία εγγράφων και άλλες εξειδικευμένες υπηρεσίες γραμματειακής υποστήριξης γραφείου'),(144,'Άλλες κοινωνικές υπηρεσίες χωρίς παροχή καταλύματος π.δ.κ.α.'),(145,'Λιανικό εμπόριο βιολογικών τροφίμων'),(146,'Ρύθμιση των δραστηριοτήτων για την παροχή περίθαλψης υγείας, εκπαίδευσης, πολιτιστικών και άλλων κοινωνικών υπηρεσιών, εκτός από την κοινωνική ασφάλιση'),(147,'Συνδυασμένες βοηθητικές υπηρεσίες σε κτίρια και εξωτερικούς χώρους (καθαρισμού, φύλαξης, υποδοχής κλπ)'),(148,'Άλλες υπηρεσίες καθαρισμού'),(149,'Εμπορικοί αντιπρόσωποι που μεσολαβούν στην πώληση ακατέργαστων αγροτικών προϊόντων γενικά'),(150,'Υπηρεσίες σχεδιασμού διάρθρωσης ή αναδιάρθρωσης επιχείρησης'),(151,'Υπηρεσίες λογοθεραπείας'),(152,'Κατασκευή κοστουμιών-ταγιέρ, συνόλων, σακακιών κάθε είδους, φορεμάτων, φουστών, φουστών-παντελονιών (ζιπ-κιλότ), παντελονιών, φορμών με τιράντες (σαλοπέτ), κοντών παντελονιών που καλύπτουν και το γόνατο (βερμούδων) και παντελονιών κοντών (σορτς), πλεκτών ή κροσέ για γυναίκες ή κορίτσια'),(153,'Υπηρεσίες ηχητικής κάλυψης καλλιτεχνικών εκδηλώσεων'),(154,'Υπηρεσίες παροχής γευμάτων με πλήρη εξυπηρέτηση εστιατορίου'),(155,'Έκδοση έντυπων βιβλίων'),(156,'Υπηρεσίες συλλογής μη επικίνδυνων ανακυκλώσιμων απορριμμάτων, άλλων'),(157,'Έκδοση εφημερίδων'),(158,'Ασύρματες τηλεπικοινωνιακές δραστηριότητες'),(159,'Καλλιέργεια ελιών για την παραγωγή ελαιόλαδου'),(160,'Υπηρεσίες λειτουργίας μουσείων'),(161,'Υπηρεσίες που παρέχονται από εστιατόρια, που πωλούν μερίδες φαγητού σε πακέτα'),(162,'Υπηρεσίες διαχείρισης κτιρίων πολυκατοικιών'),(163,'Τεχνική και επαγγελματική δευτεροβάθμια εκπαίδευση'),(164,'Υπηρεσίες δημοσίων σχέσεων και επικοινωνίας'),(165,'Υπηρεσίες συντήρησης βιβλιακού και αρχειακού υλικού'),(166,'Υπηρεσίες διδασκαλίας (εισηγήσεων) σε επιμορφωτικά σεμινάρια'),(167,'Υπηρεσίες φυσιοθεραπευτή'),(168,'Λιανικό εμπόριο ηλεκτρονικών υπολογιστών, περιφερειακών μονάδων και λογισμικού'),(169,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης σε άλλες κοινωνικές επιστήμες'),(170,'Διοικητικές υπηρεσίες που σχετίζονται με τουριστικά θέματα'),(171,'Υπηρεσίες αισθητικών και υπηρεσίες περιποίησης των νυχιών'),(172,'Άλλες δραστηριότητες ανθρώπινης υγείας'),(173,'Υπηρεσίες ημερήσιας φροντίδας για παιδιά και νέους με αναπηρία'),(174,'Δραστηριότητες πρακτορείων ειδήσεων'),(175,'Φυτική και ζωική παραγωγή, θήρα και συναφείς δραστηριότητες'),(176,'Υπηρεσίες επαγγελματικής αποκατάστασης για άτομα με αναπηρίες'),(177,'Έκδοση έντυπων βιβλίων, φυλλάδιων κάθε είδους, και παρόμοιων ειδών'),(178,'Παραγωγή τυροπιτών, σάντουιτς και παρόμοιων ειδών'),(179,'Υπηρεσίες καθηγητή φυσικής αγωγής ή γυμναστή'),(180,'Υπηρεσίες υποστηρικτικές προς την εκπαίδευση'),(181,'Συλλογή μη επικίνδυνων απορριμμάτων'),(182,'Υπηρεσίες ωδείου'),(183,'Δραστηριότητες λογιστικής, τήρησης βιβλίων και λογιστικού ελέγχου· παροχή φορολογικών συμβουλών'),(184,'Γενικές υπηρεσίες προσωπικού για το δημόσιο'),(185,'Υπηρεσίες δημιουργίας ιστοσελίδων στο διαδίκτυο'),(186,'Άλλη εκπαίδευση π.δ.κ.α.'),(187,'Παραγωγή ηλεκτρικού ρεύματος'),(188,'Ιατρικές υπηρεσίες ειδικότητας οφθαλμολογίας'),(189,'Υπηρεσίες παροχής συμβουλών ανάπτυξης κάθε είδους αγροτικών εκμεταλλεύσεων'),(190,'Άλλες δραστηριότητες κοινωνικής μέριμνας χωρίς παροχή καταλύματος π.δ.κ.α.'),(191,'Υπηρεσίες που παρέχονται από καφέ μπαρ'),(192,'Υπηρεσίες εκμετάλλευσης οικήματος, για διενέργεια εκδηλώσεων (π.χ. γάμων και συναφών) '),(193,'Υπηρεσίες εκμετάλλευσης εκθεσιακών χώρων'),(194,'Λιανικό εμπόριο ακατέργαστων αγροτικών προϊόντων π.δ.κ.α.'),(195,'Δραστηριότητες επιχειρηματικών και εργοδοτικών οργανώσεων'),(196,'Διαχείριση ακίνητης περιουσίας, έναντι αμοιβής ή βάσει σύμβασης'),(197,'Υπηρεσίες παροχής συμβουλών σε θέματα μάρκετινγκ'),(198,'Υπηρεσίες περιβαλλοντικής έρευνας'),(199,'Υπηρεσίες διοργάνωσης ψυχαγωγικών εκδηλώσεων (π.χ. γάμων και συναφών)'),(200,'Υπηρεσίες άλλων μη κυβερνητικών οργανώσεων'),(201,'Εκπαιδευτικές υποστηρικτικές δραστηριότητες'),(202,'Υπηρεσίες ομοιοπαθητικής'),(203,'Υπηρεσίες θεάματος ήχος και φως'),(204,'Χονδρικό εμπόριο γαλακτοκομικών προϊόντων'),(205,'Υποστηρικτικές δραστηριότητες για τις τέχνες του θεάματος'),(206,'Παραγωγή οίνου από σταφύλια'),(207,'Διάθεση διαφημιστικού χώρου ή χρόνου στο διαδίκτυο'),(208,'Δραστηριότητες φροντίδας με παροχή καταλύματος για ηλικιωμένους και άτομα με αναπηρία'),(209,'Παραγωγή επεξεργασμένων και συντηρημένων καρπών με κέλυφος, αράπικων φιστικιών, που διαθέτονται καβουρδισμένα, αλατισμένα ή με άλλο τρόπο παρασκευασμένα'),(210,'Υπηρεσίες επισκέψεων σε ηλικιωμένους'),(211,'Καλλιέργεια ελιών'),(212,'Υπηρεσίες τουριστικών ξεναγών'),(213,'Λιανικό εμπόριο τυποποιημένων ζαχαρωδών προϊόντων'),(214,'Υπηρεσίες τουριστικής προβολής'),(215,'Παραγωγή επιγραμμικών (on line) εφημερίδων'),(216,'Υπηρεσίες παροχής γευμάτων και ποτών από σνακ μπαρ, με παροχή σερβιρίσματος'),(217,'Λιανικό εμπόριο σε μη εξειδικευμένα καταστήματα που πωλούν κυρίως τρόφιμα, ποτά ή καπνό'),(218,'Υπηρεσίες ασφαλιστικού συμβούλου, με επαγγελματική εγκατάσταση'),(219,'Ανάκτηση διαλεγμένου υλικού'),(220,'Υπηρεσίες που παρέχονται από άλλες οργανώσεις πολιτών και κοινωνικές οργανώσεις'),(221,'Λιανικό εμπόριο κλωστοϋφαντουργικών προϊόντων, ενδυμάτων και υποδημάτων, σε υπαίθριους πάγκους και αγορές'),(222,'Υπηρεσίες επισκεπτών νοσοκόμων'),(223,'Υδραυλικές και κλιματιστικές εγκαταστάσεις θέρμανσης και ψύξης'),(224,'Υπηρεσίες διάθεσης χώρου καταστήματος για προβολή αγαθών'),(225,'Υπηρεσίες τροφοδοσίας συνεστιάσεων - εκδηλώσεων (catering) σε επαγγελματικούς χώρους'),(226,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης στη νομική επιστήμη'),(227,'Υπηρεσίες επισκευής ηλεκτρονικών υπολογιστών και περιφερειακού εξοπλισμού'),(228,'Άλλες αθλητικές υπηρεσίες'),(229,'Υπηρεσίες ειδησεογραφικών πρακτορείων προς οπτικοακουστικά μέσα'),(230,'Συνδυασμένες διοικητικές δραστηριότητες γραφείου'),(231,'Υπηρεσίες εκμετάλλευσης κινηματογραφικών ταινιών'),(232,'Κατασκευή άλλων προϊόντων από ξύλο· κατασκευή ειδών από φελλό και ειδών καλαθοποιίας και σπαρτοπλεκτικής'),(233,'Λιανικό εμπόριο ψωμιού, αρτοσκευασμάτων και λοιπών ειδών αρτοποιίας και ζαχαροπλαστικής σε εξειδικευμένα καταστήματα'),(234,'Υπηρεσίες διαχείρισης επιχειρηματικών διαδικασιών'),(235,'Υπηρεσίες δερματοστιξίας (τατουάζ)'),(236,'Λιανικό εμπόριο ειδών διατροφής γενικά'),(237,'Υπηρεσίες αθλητικής και ψυχαγωγικής εκπαίδευσης'),(238,'Αλιεία ψαριών, που διαθέτονται νωπά ή απλής ψύξης'),(239,'Υπηρεσίες σωματικής ευεξίας'),(240,'Υπηρεσίες αποκλειστικών νοσοκόμων'),(241,'Λιανικό εμπόριο ρολογιών και κοσμημάτων, με αλληλογραφία ή μέσω διαδίκτυου'),(242,'Κατασκευή επεξεργασμένου χαρτιού και χαρτονιού'),(243,'Υπηρεσίες γυμναστηρίου ειδικών γυμναστικών (αεροβικής, πιλάτες, γιόγκα κλπ)'),(244,'Υπηρεσίες πιστοποίησης συστημάτων διαχείρισης ποιότητας'),(245,'Έκδοση έντυπων περιοδικών κάθε είδους'),(246,'Καλλιέργεια λαχανικών, που διαθέτονται νωπά, π.δ.κ.α.'),(247,'Υπηρεσίες που παρέχονται [εκτός της χορήγησης ενισχύσεων (επιχορηγήσεων)] από άλλες οργανώσεις π.δ.κ.α.'),(248,'Υπηρεσίες εκμετάλλευσης προγραμμάτων θεαμάτων'),(249,'Υπηρεσίες επίσκεψης αρχαιολογικών και άλλων ιστορικών χώρων και κτιρίων'),(250,'Υπηρεσίες διάσωσης ατόμων (στη θάλασσα, στα βουνά, σε φυσικές καταστροφές)'),(251,'Κατασκευή βρεφικών βαπτιστικών ενδυμάτων, πλεκτών ή κροσέ'),(252,'Υπηρεσίες που παρέχονται από οικολογικά σωματεία'),(253,'Υπηρεσίες λειτουργίας ιστορικών χώρων και κτιρίων και παρόμοιων αξιοθέατων'),(254,'Άλλες υπηρεσίες κοινωνικής μέριμνας χωρίς παροχή καταλύματος π.δ.κ.α.'),(255,'Υπηρεσίες ταχυμεταφορών πολλαπλής φύσης'),(256,'Υπηρεσίες ειδικού παιδαγωγού'),(257,'Λιανικό εμπόριο φαρμακευτικών αφεψημάτων βοτάνων'),(258,'Λιανικό εμπόριο κομμένων ανθέων και μπουμπουκιών τους, συνθέσεων ανθέων, καθώς και ανθοδεσμών, στεφανιών και παρόμοιων ειδών'),(259,'Παραγωγή σαπουνιού και επιφανειοδραστικών οργανικών προϊόντων και παρασκευασμάτων που χρησιμοποιούνται ως σαπούνι· χαρτιού, βατών, πιλημάτων (τσοχών) και μη υφασμένων υφασμάτων, εμποτισμένων, επιχρισμένων ή καλυμμένων με σαπούνι ή απορρυπαντικά'),(260,'Παραγωγή σαπουνιού πολυτελείας'),(261,'Υπηρεσίες δωματίου ή μονάδας καταλύματος για σπουδαστές σε φοιτητικές εστίες και σχολικούς κοιτώνες'),(262,'Εμπορικοί αντιπρόσωποι που μεσολαβούν στην πώληση άλλων πλαστικών προϊόντων'),(263,'Παραγωγή περιεχόμενου δικτυακών πυλών (web portals)'),(264,'Υπηρεσίες έκθλιψης ελαιόκαρπου και άλλων ελαιούχων σπόρων'),(265,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης στις κοινωνικές επιστήμες'),(266,'Χονδρικό εμπόριο ειδών κοσμηματοποιίας και μερών τους, ειδών χρυσοχοΐας ή αργυροχοΐας και μερών τους'),(267,'Υπηρεσίες που παρέχονται από επιχειρηματικές και εργοδοτικές οργανώσεις'),(268,'Υπηρεσίες ραδιοφωνικού προγραμματισμού και εκπομπών'),(269,'Υπηρεσίες εκπαίδευσης μέσω υπολογιστή'),(270,'Υπηρεσίες θεάματος κουκλοθέατρου'),(271,'Λιανικό εμπόριο ειδών υγιεινής διατροφής'),(272,'Υπηρεσίες πάρκου αναψυχής'),(273,'Χονδρικό εμπόριο φρούτων και λαχανικών'),(274,'Υπηρεσίες γραφείων οργανωμένων ταξιδιών'),(275,'Υπηρεσίες χορήγησης άδειας για τα δικαιώματα χρήσης ακουστικών πρωτοτύπων'),(276,'Υπηρεσίες σποράς και φύτευσης αγροτικών προϊόντων'),(277,'Υπηρεσίες σχετικές με την εγκυμοσύνη'),(278,'Υπηρεσίες ενοικίασης πλοίων ψυχαγωγίας (κότερων, θαλαμηγών, βενζινακάτων κλπ), χωρίς πλήρωμα'),(279,'Υπηρεσίες διάθεσης απορριμμάτων από χαρτί και χαρτόνι'),(280,'Υπηρεσίες προβολής κινηματογραφικών ταινιών'),(281,'Λιανικό εμπόριο υλικών ραπτικής γενικά'),(282,'Άλλες υπηρεσίες έρευνας και πειραματικής ανάπτυξης στη μηχανική και την τεχνολογία, εκτός της βιοτεχνολογίας'),(283,'Υπηρεσίες φροντίδας με παροχή καταλύματος για ηλικιωμένους και αναπήρους'),(284,'Παροχή υπηρεσιών εφαρμογών πληροφορικής'),(285,'Παραγωγή αλευριών σιτηρών και φυτικών αλευριών· μειγμάτων τους'),(286,'Χονδρικό εμπόριο διάφορων εκκλησιαστικών ειδών'),(287,'Παραγωγή σαπουνιού, παρασκευασμάτων πλύσης και καθαρισμού'),(288,'Υπηρεσίες μουσικής ορχήστρας'),(289,'Υπηρεσίες επισκευής και μετατροπής ενδυμάτων και κλωστοϋφαντουργικών ειδών οικιακής χρήσης'),(290,'Υπηρεσίες έρευνας στην πληροφορική'),(291,'Υπηρεσίες μουσικής κάλυψης εκδηλώσεων, υπηρεσίες disk jockey (D.J.)'),(292,'Υπηρεσίες κοινωφελών ιδρυμάτων και σωματείων'),(293,'Υπηρεσίες επισκευής και συντήρησης εξοπλισμού λεβήτων σε διάφορα συστήματα σωληνώσεων'),(294,'Άλλες υπηρεσίες εκπαίδευσης π.δ.κ.α.'),(295,'Υπηρεσίες που παρέχονται από οργανώσεις για τα ανθρώπινα δικαιώματα'),(296,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης στα οικονομικά και τις επιχειρήσεις'),(297,'Υπηρεσίες διάθεσης μη επικίνδυνων απορριμμάτων'),(298,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης στη μηχανική και την τεχνολογία, εκτός της βιοτεχνολογίας'),(299,'Υπηρεσίες καθηγητή μουσικής'),(300,'Υπηρεσίες θεάματος π.δ.κ.α.'),(301,'Υπηρεσίες ημερήσιας φροντίδας για παιδιά'),(302,'Εμπορικοί αντιπρόσωποι που μεσολαβούν στην πώληση κλωστοϋφαντουργικών προϊόντων'),(303,'Καλλιέργεια φακών, που διαθέτονται αποξηραμένα'),(304,'Καλλιέργεια δημητριακών (εκτός ρυζιού), οσπρίων και ελαιούχων σπόρων'),(305,'Υπηρεσίες διανομής διαφημιστικού υλικού (φέιγ βολάν κλπ)'),(306,'Υπηρεσίες οδικής μεταφοράς επιβατών για περιήγηση σε αξιοθέατα'),(307,'Επεξεργασία δεδομένων, καταχώρηση και συναφείς δραστηριότητες'),(308,'Υπηρεσίες σχεδιασμού διαφημιστικών αφισών'),(309,'Διοικητικές υπηρεσίες για τη ρύθμιση των υγειονομικών, εκπαιδευτικών, πολιτιστικών και άλλων κοινωνικών υπηρεσιών, εκτός της κοινωνικής ασφάλισης'),(310,'Καλλιέργεια σκληρού σιταριού'),(311,'Άλλο λιανικό εμπόριο άλλων προϊόντων τροφίμων, ποτών και καπνού εκτός καταστημάτων, υπαίθριων πάγκων ή αγορών'),(312,'Υπηρεσίες παροχής γευμάτων και ποτών από σνακ μπαρ, ουζερί, μεζεδοπωλείο, τσιπουράδικο, ζυθοπωλείο, με παροχή καθίσματος αλλά όχι σερβιρίσματος'),(313,'Υπηρεσίες αγροτικών μηχανημάτων εποχιακής χρήσης (θεριζοαλωνιστικών, βαμβακοσυλλεκτικών κλπ)'),(314,'Λιανικό εμπόριο μελανιών, με αναγόμωση φυσιγγίων (cartridges) εκτυπωτών'),(315,'Άλλες επαγγελματικές, επιστημονικές και τεχνικές δραστηριότητες π.δ.κ.α.'),(316,'Χονδρικό εμπόριο σαλτσών, ανάμεικτων καρυκευμάτων και αρτυμάτων, αλευριού και χονδράλευρου σιναπιού και παρασκευασμένης μουστάρδας'),(317,'Δραστηριότητες ταξιδιωτικών πρακτορείων'),(318,'Παραγωγή έτοιμων γευμάτων και φαγητών'),(319,'Χονδρικό εμπόριο ξυλείας σε πελεκούδια ή σε μόρια'),(320,'Οργάνωση συνεδρίων και εμπορικών εκθέσεων'),(321,'Υπηρεσίες ενοικίασης ποδηλάτων'),(322,'Λογιστικές υπηρεσίες'),(323,'Υπηρεσίες μηχανικών για ενεργειακά έργα'),(324,'Υπηρεσίες ημερήσιας φροντίδας για παιδιά, εκτός όσων αφορούν παιδιά με αναπηρία'),(325,'Υπηρεσίες παραγωγής εκπαιδευτικών ταινιών'),(326,'Χονδρικό εμπόριο υλικών καθαρισμού'),(327,'Υπηρεσίες σχολών χορού και διδασκάλων χορού'),(328,'Υπηρεσίες παραγωγής μουσικών δίσκων, ταινιών ή άλλων εγγραφών μουσικής σε φυσικά μέσα'),(329,'Παραγωγή φυτικών ελαίων, που διαθέτονται ακατέργαστα'),(330,'Υπηρεσίες σχολών υποκριτικής'),(331,'Λιανικό εμπόριο άλλων προϊόντων τροφίμων, ποτών και καπνού'),(332,'Υπηρεσίες βιβλιοθηκών'),(333,'Υπηρεσίες κολυμβητηρίου (πισίνας)'),(334,'Υπηρεσίες που παρέχονται από οργανώσεις νέων'),(335,'Δραστηριότητες παροχής συμβουλών σχετικά με τους ηλεκτρονικούς υπολογιστές'),(336,'Υπηρεσίες επεξεργασίας μη επικίνδυνων απορριμμάτων για τελική διάθεση'),(337,'Εργασίες υπεργολαβίας στο πλαίσιο της διαδικασίας παραγωγής άλλων ειδών κλωστοϋφαντουργίας π.δ.κ.α.'),(338,'Υπηρεσίες προώθησης βιβλίων'),(339,'Λιανικό εμπόριο άλλων προϊόντων διατροφής π.δ.κ.α.'),(340,'Υπηρεσίες κέντρων ημερήσιας φροντίδας ενηλίκων με αναπηρίες'),(341,'Δικτυακές πύλες (web portals)'),(342,'Λιανικό εμπόριο παιχνιδιών κάθε είδους σε εξειδικευμένα καταστήματα'),(343,'Άλλες πολυετείς καλλιέργειες'),(344,'Υπηρεσίες υποστήριξης καλλιτεχνών'),(345,'Υπηρεσίες διοργάνωσης περιηγήσεων (πρακτορείο ταξιδίων) για οργανωμένο τουρισμό από το εξωτερικό'),(346,'Χονδρικό εμπόριο ειδών ιματισμού (ενδυμάτων)'),(347,'Υπηρεσίες καθαρισμού ειδικών επαγγελματικών χώρων (νοσοκομείων κλπ)'),(348,'Παραγωγή παξιμαδιών και μπισκότων· παραγωγή διατηρούμενων ειδών ζαχαροπλαστικής'),(349,'Χονδρικό εμπόριο ρολογιών και κοσμημάτων'),(350,'Λιανικό εμπόριο δερμάτινων ειδών και ειδών ταξιδιού, με αλληλογραφία ή μέσω διαδίκτυου'),(351,'Υπηρεσίες συλλογής μη επικίνδυνων ανακυκλώσιμων απορριμμάτων, δημοτικών'),(352,'Υπηρεσίες παροχής γευμάτων και ποτών από κυλικείο'),(353,'Κατασκευαστικές εργασίες για οικιστικά κτίρια (νέες εργασίες, προσθήκες, μετατροπές και ανακαινίσεις)'),(354,'Υπηρεσίες που παρέχονται από περιβαλλοντικές ομάδες'),(355,'Υπηρεσίες σχολών χορού'),(356,'Βασικές υπηρεσίες διαδίκτυου'),(357,'Λιανικό εμπόριο ψαριών, οστρακοειδών και μαλακίων'),(358,'Υπηρεσίες πρόνοιας χωρίς παροχή καταλύματος'),(359,'Υπηρεσίες σχεδιασμού και πιστοποίησης εκπαιδευτικών προγραμμάτων'),(360,'Υπηρεσίες εκτελεστή μουσικών έργων'),(361,'Καλλιέργεια αρωματικών φυτών'),(362,'Παραγωγή και συντήρηση τοματοπολτού και πουρέ από ντομάτες'),(363,'Υπηρεσίες λαϊκής επιμόρφωσης'),(364,'Άλλες υπηρεσίες αθλητισμού και αναψυχής'),(365,'Επεξεργασία και συντήρηση ψαριών και φιλέτων ψαριών, καπνιστών'),(366,'Υπηρεσίες πληροφορίας π.δ.κ.α.'),(367,'Υπηρεσίες που παρέχονται από συγγραφείς, συνθέτες, γλύπτες και άλλους καλλιτέχνες, εκτός των καλλιτεχνών του θεάματος'),(368,'Υπηρεσίες συμβούλου σε θέματα προώθησης πωλήσεων'),(369,'Καλλιέργεια άλλων δενδρωδών και θαμνωδών καλλιεργειών φρούτων και καρπών με κέλυφος'),(370,'Υπηρεσίες φροντίδας ζώων συντροφιάς'),(371,'Λιανικό εμπόριο μη εδώδιμων μη καταναλωτικών προϊόντων π.δ.κ.α.'),(372,'Χονδρικό εμπόριο ιατρικών αναλώσιμων υλικών'),(373,'Υπηρεσίες χημικών δοκιμών και αναλύσεων'),(374,'Υπηρεσίες εκμετάλλευσης παιχνιδιών θάλασσας (θαλάσσιων ποδηλάτων, κανό και παρόμοιων ειδών αναψυχής)'),(375,'Υπηρεσίες εργολάβου καθαριότητας'),(376,'Κατασκευή άλλων ξύλινων επίπλων, από μονάδα που απασχολεί τρεις και άνω εργάτες'),(377,'Εμπορικοί αντιπρόσωποι που μεσολαβούν στην πώληση κλωστοϋφαντουργικών προϊόντων, ενδυμάτων, γουναρικών, υποδημάτων και δερμάτινων προϊόντων'),(378,'Υπηρεσίες γραφίστα διαφημίσεων'),(379,'Υπηρεσίες ψυχαγωγικών μη αθλητικών λεσχών'),(380,'Κατασκευή ανδρικών ενδυμάτων εργασίας'),(381,'Υπηρεσίες παροχής γευμάτων από κέντρο διασκέδασης - κοσμική ταβέρνα'),(382,'Κατασκευή ξύλινων επίπλων κουζίνας, από μονάδα που απασχολεί μέχρι και δύο εργάτες'),(383,'Λιανικό εμπόριο βιβλίων'),(384,'Καλλιτεχνική δημιουργία'),(385,'Άλλες υπηρεσίες καθαρισμού π.δ.κ.α.'),(386,'Λιανικό εμπόριο ηλεκτρονικών υπολογιστών, περιφερειακών μονάδων υπολογιστών και λογισμικού σε εξειδικευμένα καταστήματα'),(387,'Παραγωγή μακαρονιών, ρυζομακάρονων (noodles), κουσκούς και παρόμοιων αλευρωδών προϊόντων'),(388,'Άλλες δραστηριότητες παροχής προσωπικών υπηρεσιών π.δ.κ.α.'),(389,'Υπηρεσίες παροχής συμβουλών οργάνωσης της μεθόδου εργασίας'),(390,'Χονδρικό εμπόριο οπωροκηπευτικών'),(391,'Χονδρικό εμπόριο ελαιών'),(392,'Θραύση, καθαρισμός και διαλογή άλλων απορριμμάτων (π.χ. από κατεδαφίσεις) για την ανάκτηση μεταλλικών δευτερογενών πρώτων υλών'),(393,'Εργασίες θερμομόνωσης εξωτερικών επιφανειών τοίχων'),(394,'Υπηρεσίες αντιγραφής φιλμ και οπτικοακουστικών μέσων'),(395,'Υπηρεσίες παροχής γευμάτων από εστιατόριο, ταβέρνα, ψαροταβέρνα, ψησταριά, χωρίς ζωντανή μουσική ή με ορχήστρα λιγότερη των τριών οργάνων [που δεν υπάγεται στην 1059176/625/ΠΟΛ.1087/25.6.2003 (ΦΕΚ Β\" 932) απόφαση Υπουργού Οικονομίας και Οικονομικών, όπως ισχύει κάθε φορά], με παροχή σερβιρίσματος'),(396,'Παραγωγή χυμών φρούτων και λαχανικών'),(397,'Επιγραμμικές (on line) υπηρεσίες μεταδευτεροβάθμιας μη τριτοβάθμιας γενικής εκπαίδευσης'),(398,'Υπηρεσίες κοπής καυσόξυλων'),(399,'Υπηρεσίες έρευνας και πειραματικής ανάπτυξης διεπιστημονικού χαρακτήρα (γεωγραφία, παιδαγωγικές σπουδές, κλπ)'),(400,'Καλλιέργεια άλλων λαχανικών που φέρουν καρπούς π.δ.κ.α.'),(401,'Άλλες υπηρεσίες μεταδευτεροβάθμιας μη τριτοβάθμιας τεχνικής και επαγγελματικής εκπαίδευσης'),(402,'Καλλιέργεια κηπευτικών υπαίθρου'),(403,'Υπηρεσίες εκμίσθωσης μικρής διάρκειας δωματίων σπιτιών'),(404,'Υπηρεσίες παραγωγής φωτοτυπιών και φωτοαντιγράφων'),(405,'Υπηρεσίες σχεδιασμού εσωτερικών χώρων, βιομηχανικής σχεδίασης και άλλες υπηρεσίες εξειδικευμένου σχεδιασμού'),(406,'Καλλιέργεια ζαχαροκάλαμων'),(407,'Διάφορες ψυχαγωγικές υπηρεσίες π.δ.κ.α.'),(408,'Υπηρεσίες κοινωνικής αρωγής σε θύματα θεομηνιών, πρόσφυγες, μετανάστες κλπ, χωρίς παροχή καταλύματος'),(409,'Έλλειψη δραστηριότητας, λόγω μη δραστηριοποίησης μέχρι σήμερα'),(410,'Παραγωγή αβγών με το κέλυφος, που διαθέτονται νωπά'),(411,'Υπηρεσίες οδηγιών διατροφής από ειδικούς που δεν είναι γιατροί'),(412,'Κατασκευή σεντονιών και μαξιλαροθηκών'),(413,'Υπηρεσίες φορτοεκφόρτωσης και στοίβασης φορτίων σε εγκαταστάσεις τερματικών σταθμών κάθε μέσου μεταφοράς'),(414,'Παραγωγή πρωτοτύπων έργων ζωγράφων, γραφιστών και γλυπτών'),(415,'Χονδρικό εμπόριο νωπών φρούτων και λαχανικών'),(416,'Λιανικό εμπόριο super market, με έμφαση στο εμπόριο τροφίμων'),(417,'Παραγωγή υλικών φύτευσης: ζώντων φυτών, κονδύλων, βολβών και ριζών· μοσχευμάτων και παραφυάδων (ξεμασκαλιδιών)· μυκηλίων μανιταριών'),(418,'Άλλο λιανικό εμπόριο ειδών ιματισμού εκτός καταστημάτων, υπαίθριων πάγκων ή αγορών'),(419,'Λιανικό εμπόριο -μετά από εισαγωγή- έτοιμων ανδρικών και γυναικείων ενδυμάτων'),(420,'Καλλιέργεια οσπρίων, που διαθέτονται αποξηραμένα'),(421,'Ναυπήγηση παράκτιων σκαφών και υποδομής'),(422,'Υπηρεσίες διαχείρισης ακινήτων έναντι αμοιβής ή βάσει σύμβασης'),(423,'Υπηρεσίες ψυχοθεραπευτή'),(424,'Υπηρεσίες ανεξάρτητου δημοσιογράφου'),(425,'Υπηρεσίες επεξεργασίας και τυποποίησης ελαιόλαδου'),(426,'Άλλες υπηρεσίες που αφορούν την ανθρώπινη υγεία π.δ.κ.α.'),(427,'Υπηρεσίες διόρθωσης τυπογραφικών δοκιμίων'),(428,'Εκτροφή αιγοπροβάτων'),(429,'Υπηρεσίες συμβούλων διαχείρισης από οργανωμένο γραφείο, που απασχολεί πάνω από 30 άτομα'),(430,'Καλλιέργεια σταφυλιών οινοποιίας κοινών'),(431,'Υπηρεσίες μάγειρα (με σύμβαση έργου)'),(432,'Υπηρεσίες διερμηνείας'),(433,'Υπηρεσίες παιδικού και βρεφονηπιακού σταθμού'),(434,'Υπηρεσίες κουρέματος, πλυσίματος, καλλωπισμού ζώων συντροφιάς'),(435,'Παραγωγή άλλων χυμών λαχανικών και φρούτων'),(436,'Υπηρεσίες ξενοδοχείου ύπνου, Β\" κατηγορίας και κάτω, χωρίς εστιατόριο'),(437,'Παραγωγή παρασκευασμάτων ομορφιάς, μακιγιάζ (make-up) ή φροντίδας του δέρματος (περιλαμβάνονται και τα αντιηλιακά) π.δ.κ.α.'),(438,'Υπηρεσίες λειτουργίας καλλιτεχνικών εγκαταστάσεων'),(439,'Άλλες δραστηριότητες φροντίδας με παροχή καταλύματος'),(440,'Υπηρεσίες παροχής επιχειρηματικών συμβουλών διαχείρισης'),(441,'Εργασίες χρωματισμών'),(442,'Υπηρεσίες παροχής γεωλογικών και γεωφυσικών συμβουλών'),(443,'Χονδρικό εμπόριο ηλεκτρονικών υπολογιστών, περιφερειακού εξοπλισμού υπολογιστών και λογισμικού'),(444,'Υπηρεσίες ενοικίασης επιπλωμένων δωματίων ή διαμερισμάτων για μικρή διάρκεια'),(445,'Άλλες υπηρεσίες που αφορούν την ανθρώπινη υγεία'),(446,'Υπηρεσίες στάθμευσης και φύλαξης σκαφών, σε χερσαίο χώρο'),(447,'Επεξεργασία και διάθεση μη επικίνδυνων απορριμμάτων'),(448,'Υπηρεσίες ενοικίασης λεωφορείων και αμαξών με οδηγό'),(449,'Άλλες υπηρεσίες που σχετίζονται με θέματα δημόσιας τάξης και ασφάλειας'),(450,'Δημιουργικές δραστηριότητες, τέχνες και διασκέδαση'),(451,'Παραγωγή χαλβάδων, κουφέτων και λουκουμιών'),(452,'Καλλιέργεια μανιταριών και τρουφών'),(453,'Υπηρεσίες περισυλλογής και συγκομιδής αγροτικών προϊόντων'),(454,'Χονδρικό εμπόριο, εκτός από το εμπόριο μηχανοκίνητων οχημάτων και μοτοσικλετών'),(455,'Υπηρεσίες έρευνας στην κτηνοτροφία');
/*!40000 ALTER TABLE `mainactivity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `municipality`
--

DROP TABLE IF EXISTS `municipality`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `municipality` (
  `MunicipalityID` int(11) NOT NULL,
  `MunicipalityDescr` varchar(250) DEFAULT NULL,
  `RegionalUnity_RegionalUnityID` int(11) NOT NULL,
  PRIMARY KEY (`MunicipalityID`),
  KEY `fk_Municipality_RegionalUnity1_idx` (`RegionalUnity_RegionalUnityID`),
  CONSTRAINT `fk_Municipality_RegionalUnity1` FOREIGN KEY (`RegionalUnity_RegionalUnityID`) REFERENCES `regionalunity` (`regionalunityid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `municipality`
--

LOCK TABLES `municipality` WRITE;
/*!40000 ALTER TABLE `municipality` DISABLE KEYS */;
/*!40000 ALTER TABLE `municipality` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `region`
--

DROP TABLE IF EXISTS `region`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `region` (
  `RegionID` int(11) NOT NULL,
  `RegionDescr` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`RegionID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `region`
--

LOCK TABLES `region` WRITE;
/*!40000 ALTER TABLE `region` DISABLE KEYS */;
/*!40000 ALTER TABLE `region` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `regionalunity`
--

DROP TABLE IF EXISTS `regionalunity`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `regionalunity` (
  `RegionalUnityID` int(11) NOT NULL,
  `RegionalUnityDescr` varchar(250) DEFAULT NULL,
  `Region_RegionID` int(11) NOT NULL,
  PRIMARY KEY (`RegionalUnityID`),
  KEY `fk_RegionalUnity_Region1_idx` (`Region_RegionID`),
  CONSTRAINT `fk_RegionalUnity_Region1` FOREIGN KEY (`Region_RegionID`) REFERENCES `region` (`regionid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `regionalunity`
--

LOCK TABLES `regionalunity` WRITE;
/*!40000 ALTER TABLE `regionalunity` DISABLE KEYS */;
/*!40000 ALTER TABLE `regionalunity` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `registrytype`
--

DROP TABLE IF EXISTS `registrytype`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `registrytype` (
  `RegistryTypeID` int(11) NOT NULL,
  `RegistryTypeDescr` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`RegistryTypeID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `registrytype`
--

LOCK TABLES `registrytype` WRITE;
/*!40000 ALTER TABLE `registrytype` DISABLE KEYS */;
INSERT INTO `registrytype` VALUES (1,'ΜΚΕ'),(2,'ΕΜΑΘ');
/*!40000 ALTER TABLE `registrytype` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `representative`
--

DROP TABLE IF EXISTS `representative`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `representative` (
  `RepresentativeID` int(11) NOT NULL,
  `RepresentativeFullName` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`RepresentativeID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `representative`
--

LOCK TABLES `representative` WRITE;
/*!40000 ALTER TABLE `representative` DISABLE KEYS */;
/*!40000 ALTER TABLE `representative` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `status`
--

DROP TABLE IF EXISTS `status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `status` (
  `StatusID` int(11) NOT NULL,
  `StatusDescr` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`StatusID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `status`
--

LOCK TABLES `status` WRITE;
/*!40000 ALTER TABLE `status` DISABLE KEYS */;
INSERT INTO `status` VALUES (1,'Βεβαίωση Εγγραφής'),(2,'Οριστική Βεβαίωση Εγγραφής'),(3,'Οριστική Διαγραφή'),(4,'Πιστοποιητικό Μέλους'),(5,'Προσωρινή Διαγραφή');
/*!40000 ALTER TABLE `status` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-13 22:34:31
